In [2]:
import pandas as pd
import numpy as np

In [36]:
num= {"column-1": [1,2,3,4,5,6,7,10000],
      "column-2": [40,20,500,30,8,9,25,9]
     }

df= pd.DataFrame(num)

In [37]:
df

   column-1  column-2
0         1        40
1         2        20
2         3       500
3         4        30
4         5         8
5         6         9
6         7        25
7     10000         9

In [38]:
outliers=[]
def detect_outliers(data):
    
    threshold=3
    mean = np.mean(data)
    std =np.std(data)
    
    
    for i in data:
        z_score= (i - mean)/std 
        if np.abs(z_score) > threshold:
            outliers.append(i)
    return outliers

In [33]:
detect_outliers(df["column-2"])

[]

In [34]:
from scipy.stats import zscore
z_scores = zscore(df)


abs_z_scores = np.abs(z_scores)
filtered_entries = (abs_z_scores < 3).all(axis=1)
new_df = df[filtered_entries]

print(new_df)

   column-1  column-2
0         1         1
1         2         2
2         3         3
3         4     10000
4         5         4
5         6         5
6         7         6
7     10000         7

In [39]:
# calculate summary statistics
data_mean, data_std = df["column-2"].mean(), df["column-2"].std()


# identify outliers

cut_off = data_std * 3

lower, upper = data_mean - cut_off, data_mean + cut_off

# identify outliers

outliers = [x for x in df["column-2"] if x < lower or x > upper]
print('Identified outliers: %d' % len(outliers))


# remove outliers
outliers_removed = [x for x in df["column-2"] if x >= lower and x <= upper]
print('Non-outlier observations: %d' % len(outliers_removed))

Identified outliers: 0
Non-outlier observations: 8

In [10]:
abs_z_scores

   column-1  column-2
0  0.471637  0.471637
1  0.440195  0.440195
2  0.408752  0.408752
3  0.377310  2.641170
4  0.345867  0.377310
5  0.314425  0.345867
6  0.282982  0.314425
7  2.641170  0.282982

In [11]:
filtered_entries

0    True
1    True
2    True
3    True
4    True
5    True
6    True
7    True
dtype: bool

In [12]:
new_df

   column-1  column-2
0         1         1
1         2         2
2         3         3
3         4       100
4         5         4
5         6         5
6         7         6
7       100         7